{ "http://www.28msec.com/modules/assertion" : { "doc" : "<p>This module provides a set of assertion methods useful for writing tests.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/error" : { "doc" : "<p>Applications written with Sausalito use this default error module if an error happens inside a Sausalito project. An error can occur during the run time of a Sausalito project on one of the following cases: If the XQuery code raises a dynamic error that is not caught in a try-catch block. If the giv...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/cookie" : { "doc" : "<p>The Sausalito Cookie module provides function to manipulate HTTP-Cookies.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/request" : { "doc" : "<p>The Sausalito request module provides functions for accessing information contained in the current HTTP request. For example, the parameter-names function can be used to retrieve all the names of the parameters contained in a request.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/response" : { "doc" : "<p>The Sausalito response module can be used to modify the HTTP response that will be send as a result of this request. For example, the set-content-type function can be used to set the Content-Type header and determine the encoding of data in the response.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/util/cache" : { "doc" : "<p>This module contains a collection of convenience functions to help developers work with HTTP caching options.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/util/diagnostic" : { "doc" : "<p>This module provides utility functions to help with diagnostic analysis / debugging of RESTful Apps or webapps.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/http/util/multipart" : { "doc" : "<p>This module provides utility functions to help dealing with the content of multipart requests. In their implementation, all the functions use the multipart related functions of the request module (e.g. parts() or text-part()).</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/lock" : { "doc" : "<p>Sausalito provides a an application level locking mechanism that can be used e.g. to ensure exclusive access to data. As the store ensures atomicity of of single document updates, atomic updates to multiple documents are implemented using this mechanism. Locks can be acquired and re-acquired at any ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/mongodb" : { "doc" : "<p>This module provides a driver to access a MongoDB database - similar to drivers for other high-level languages like e.g. PyMongo . Here is a simple example of how we can raise the salary of each developer by 10%. Starting with an employees collection in MongoDB that contains { \"name\" : \"Peter\", \"rol...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/sequence" : { "doc" : "<p>The sequence module allows you to generate consecutive application-unique xs:integer ids. This is required e.g. in accounting applications as some legislations require consecutive invoice numbers.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/sleep" : { "doc" : "<p>This module provides a function to put the currently executing request to sleep.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/store" : { "doc" : "<p>This modules provides functions that allow to have more control over the data store. For example, the flush() function may be used to synchronously flush all pending modifications and make them available to other requests.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/ws/mailchimp" : { "doc" : "<p>Mailchimp Client Module.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.28msec.com/modules/xmlrpc" : { "doc" : "<p>XML RPC Client Module This module provides the functions necessary to execute remote call procedures using XML-RPC . The application/mashup creator does not need to know the specifics of XML-RPC to use this module. Usage: xmlrpc:invoke(\"http://www.advogato.org/XMLRPC\", \"test.sumprod\", (5, 7)) xmlrpc...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.functx.com/" : { "doc" : "<p>-------------------------------- The FunctX XQuery Function Library -------------------------------- Copyright (C) 2007 Datypic This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundatio...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/errors" : { "doc" : "<p>This module contains one declaration of a variable for each error of the http://www.zorba-xquery.com/errors namespace. The variables serves as documentation for the errors but can also be used in the code. For example, one useful scenario is to compare an error caught in the catch clause of a try-ca...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/converters/base64" : { "doc" : "<p>Base64 encoding and decoding</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/converters/csv" : { "doc" : "<p>Function library providing converters from CSV/TXT to XML and back. The functions are optimized to work with large amounts of data, in a streaming way.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/converters/html" : { "doc" : "<p>This module provides functions to tidy a HTML document. The functions in this module take an HTML document (a string) as parameter, tidy it in order to result in valid XHTML, and return this XHTML document as a document-node.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/converters/json" : { "doc" : "<p>Using this module, you can parse JSON data into XML, manipulate it like any other XML data using XQuery, and serialize the result back as JSON. There are many ways to represent JSON data in XML, some loss-less (\"round tripable\") and some lossy (\"one way\"). Loss-less representations preserve the JSON...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/cryptography/hash" : { "doc" : "<p>This module provides functions that perform different hash operations. For example, they compute MD5 and various SHA functions on either strings or binary. The result is the base64 encoded value of the hash.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/cryptography/hmac" : { "doc" : "<p>This module provides functions that perform HMAC (hash-based message authentication code) operations. For example, they calculate message codes involving hash functions such as MD5 and various SHA variants. The result is the base64 encoded value of the hash. A hash may be used to verify the data int...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/character-based-string-similarity" : { "doc" : "<p>This library module provides character-based string similarity functions that view strings as sequences of characters, generally computing a similarity score that corresponds to the cost of transforming one string into another. These functions are particularly useful for matching near duplicate stri...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/consolidation" : { "doc" : "<p>This library module provides data consolidation functions that generally take as input a sequence of XML nodes and apply some rule in order do decide which node is better suited to represent the entire sequence. The logic contained in this module is not specific to any particular XQuery implementati...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/conversion" : { "doc" : "<p>This library module provides data conversion functions for processing calendar dates, temporal values, currency values, units of measurement, location names and postal addresses. The logic contained in this module is not specific to any particular XQuery implementation.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/hybrid-string-similarity" : { "doc" : "<p>This library module provides hybrid string similarity functions, combining the properties of character-based string similarity functions and token-based string similarity functions. The logic contained in this module is not specific to any particular XQuery implementation, although the module requir...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/normalization" : { "doc" : "<p>This library module provides data normalization functions for processing calendar dates, temporal values, currency values, units of measurement, location names and postal addresses. These functions are particularly useful for converting different data representations into cannonical formats. The log...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/phonetic-string-similarity" : { "doc" : "<p>This library module provides phonetic string similarity functions, comparing strings with basis on how they sound. These metrics are particularly effective in matching names, since names are often spelled in different ways that sound the same. The logic contained in this module is not specific to an...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/set-similarity" : { "doc" : "<p>This library module provides similarity functions for comparing sets of XML nodes (e.g., sets of XML elements, attributes or atomic values). These functions are particularly useful for matching near duplicate sets of XML nodes. The logic contained in this module is not specific to any particular XQu...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/data-cleaning/token-based-string-similarity" : { "doc" : "<p>This library module provides token-based string similarity functions that view strings as sets or multi-sets of tokens and use set-related properties to compute similarity scores. The tokens correspond to groups of characters extracted from the strings being compared, such as individual words or cha...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/datetime" : { "doc" : "<p>This module provides functions to retrieve the current dateTime. In contrast to the current-dateTime functions specified in \"XQuery Functions and Operators\" the functions in this module are nondeterministic. That is, they do not return the current-dateTime from the dynamic context but return the act...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/debugger/dbgp-message-handler" : { "doc" : "<p>Zorba debugger module.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/email/imap" : { "doc" : "<p>This module provides functions for accessing and manipulating emails on mail servers through the IMAP protocol. All functions in this module receive as the first argument the IMAP host and user information. This is an element with the type hostInfoType as defined in the email schema: http://www.zorb...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/email/smtp" : { "doc" : "<p>This module can be used for sending emails. The SMTP module contains only one public function that receives two parameters. The SMTP server access information passed as an hostInfo element and the email message representation as a message element. For a quick start see the examples associates with t...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/datetime" : { "doc" : "<p>This is a library module offering the same set of functions defined by Microsoft Excel.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/engineering" : { "doc" : "<p>This is a library module offering the same set of functions defined by Microsoft Excel, under Engineering Functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/information" : { "doc" : "<p>This is a library module offering the same set of functions defined by Microsoft Excel, under Information Functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/logical" : { "doc" : "<p>This is a library module offering the same set of functions defined by Microsoft Excel, under Logical Functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/lookup" : { "doc" : "<p>This module implements some Excel 2003 lookup functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/math-sumproduct" : { "doc" : "<p>Module implementing the sumproduct functions from Excel 2003 math library. There are 30 functions defined, implementing the same function but with 1 to 30 parameters. Each parameter can be a sequence of infinite length.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/math" : { "doc" : "<p>This is a library module offering a part of the set of functions defined by Microsoft Excel 2003.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/statistical-zorba" : { "doc" : "<p>This module implements some Excel 2003 statistical functions that cannot be implemented with standard XQuery functions. It uses Zorba specific functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/statistical" : { "doc" : "<p>This is a library module offering a part of the set of statistical functions defined by Microsoft Excel 2003.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/excel/text" : { "doc" : "<p>This is a library module offering the same set of functions defined by Microsoft Excel, under Text and Data Functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/fetch" : { "doc" : "<p>This module provides functions to fetch the content of a resource identified by a URI. For example, it fetches the content of file or http resources. In order to retrieve such content, the functions use the URI resolution and URL resolver process as documented at URI Resolvers .</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/full-text" : { "doc" : "<p>This module provides an XQuery API to full-text functions. For general information about Zorba's implementation of the XQuery and XPath Full Text 1.0 specification as well as instructions for building an installing a thesaurus, see the Full Text Thesaurus documentation . Notes on languages To refer ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/http-client" : { "doc" : "<p>Introduction This module provides provides simple functions for performing HTTP requests (GET, POST, DELETE etc.), as well as a more flexible general purpose function ( send-request() ). Examples of how to use this module Simple GET Request import module namespace http=\"http://www.zorba-xquery.com/m...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/image/animation" : { "doc" : "<p>This module provides functions to create animated GIF images.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/image/basic" : { "doc" : "<p>This module provides function to do the following basic image operations: create empty images compare images compress image convert an image one format to another retrieve with, height, format, and exif information from an image The following image formats are supported: GIF JPEG PNG TIFF BMP The er...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/image/graphviz" : { "doc" : "<p>Module that provides functions for generating SVG graphs. The module provides two function for generating graphs given in the : DOT language (see http://www.graphviz.org ) or in the XML-based Graph eXchange Language (see http://www.gupro.de/GXL/ ), respectively. Both functions use the Graphviz Visua...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/image/manipulation" : { "doc" : "<p>This module provides functions to handle image manipulations like resizing, zooming, special effects etc. The errors raised by functions of this module have the namespace http://www.zorba-xquery.com/modules/image/error (associated with prefix ierr).</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/image/paint" : { "doc" : "<p>This module provides a function to extend an image with additional shapes. Fully supported image formats are: GIF JPEG PNG TIFF BMP The errors raised by functions of this module have the namespace http://www.zorba-xquery.com/modules/image/error (associated with prefix ierr).</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/introspection/sctx" : { "doc" : "<p>Introspection Module for the Static Context components.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/languages/xslt" : { "doc" : "<p>This module provides XSLT 1.0 transformation functionality. For details on XSLT see XSLT 1.0 specification . This module implements the invoking of an XSLT transformation from XQuery described in Michael Kay's proposal . Example: import module namespace xslt = \"http://www.zorba-xquery.com/modules/la...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/math" : { "doc" : "<p>Extensive math library.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/node-position" : { "doc" : "<p>This module provides a function (np:node-position) that, given a node, returns positional information about the node in the form of an xs:anyURI item. The module also defines functions that use such positional information to determine: (1) positional relationships between two nodes (e.g. if one is t...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/node-reference" : { "doc" : "<p>The module provides functions to compute an immutable and opaque reference for any node and to retrieve nodes given their identifier. The identifiers are immutable, i.e. a node identifier does not change during the node lifetime and cannot be reused for another node after the original node gets dele...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/node" : { "doc" : "<p>This module defines a set of function which can be used to determine (1) the relationship between two nodes (e.g. if one is the ancestor if another) and (2) properties of given nodes (e.g. their level in the tree). The same functionality can be achieved with simple XPath expressions. However, please...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/oauth/client" : { "doc" : "<p>This module provides the functions necessary to acquire access to the personal resources of a user through the open standard called OAuth . The application/mashup creator does not need to know the specifics of OAuth to use this module.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/oauth/error" : { "doc" : "<p>Module that defines the errors raised in Oauth modules.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/process" : { "doc" : "<p>This module provides functions to create a native process and return the result (i.e. exit code, result on standard out and error). Example: import module namespace proc = \"http://www.zorba-xquery.com/modules/process\"; proc:exec(\"ls\") Potential result: &lt;result xmlns=\"http://www.zorba-xquery.com/modu...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/project_xqdoc" : { "doc" : "<p>Function library provides functions for generating the XQDoc XML's for a project.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/random" : { "doc" : "<p>This module provides several functions for generating (pseudo-)random numbers and strings.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/reflection" : { "doc" : "<p>This module provides functions to dynamically invoke functions or main modules, respectively. Each of the functions (invoke or eval) come in four variants depending whether the expression being invoked is simple, nondeterministic, updating, or sequential.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/schema-tools" : { "doc" : "<p>This module provides funtionality to get sample XMLSchema from XML instances and sample XML instances from XMLSchema. Apache XMLBeans library is used to implement inst2xsd and xsd2inst functions. Note: Since this module has a Java library dependency a JVM required to be installed on the system. For ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/schema" : { "doc" : "<p>This module provides function that are related to XML Schema support in Zorba.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/data-structures/unordered-map" : { "doc" : "<p>This module defines a set of functions for working with maps. A map is identified by a QName and can be created using the map:create or map:create-transient functions and deleted using the map:delete function, respectively. The lifetime of a transient map is limited by the execution of the current X...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/dynamic/collections/ddl" : { "doc" : "<p>This modules defines a set of functions for managing persistent, ordered, and updatable collections. Please refer to our documentation for more information about the lifecycle management and the manipulation of such collections.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/dynamic/collections/dml" : { "doc" : "<p>This modules provides a set of functions to modify a collection and retrieve the items contained in a particular collection. Please refer to our documentation for more information about the lifecycle management and the manipulation of such collections.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/dynamic/collections/w3c/ddl" : { "doc" : "<p>This modules defines a set of functions for managing persistent, ordered, and updatable collections. Such collections are identified by a URI as defined in the XQuery specification. However, please note that we do not advice users to use collections identified by URIs. Instead, we refer to the data ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/dynamic/collections/w3c/dml" : { "doc" : "<p>This modules provides a set of functions to modify a collection and retrieve the nodes contained in a particular collection. Such collections are identified by a URI as defined in the XQuery specification. However, please note that we do not advice users to use collections identified by URIs. Instea...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/dynamic/documents" : { "doc" : "<p>This module defines a set of functions which manage documents that are persisted in the store. Specifically, it contains functions to put, remove, list, or retrieve documents. Please refer to our documentation for more information about the lifecycle management and manipulation of documents.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/collections/ddl" : { "doc" : "<p>This modules defines a set of functions for managing collections which are declared in the prolog of a module. For example, it provides functions to create, delete, or introspect collections. This module is part of Zorba's XQuery Data Definition Facility . All the collections managed by this module ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/collections/dml" : { "doc" : "<p>This modules provides a set of functions to modify a collection and retrieve the items contained in a particular collection. This module is part of Zorba's XQuery Data Definition Facility . All the collections managed by this module have to be pre-declared in the prolog of a module. Please refer to ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/indexes/ddl" : { "doc" : "<p>This modules defines a set of functions for managing indexes which are declared in the prolog of a module. This module is part of Zorba's XQuery Data Definition Facility . All the indexes managed by this module have to be pre-declared in the prolog of a module. Please refer to the general documentat...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/indexes/dml" : { "doc" : "<p>This module defines a set of functions to probe and refresh indexes which are declared in the prolog of a module. This module is part of Zorba's XQuery Data Definition Facility . All the indexes managed by this module have to be pre-declared in the prolog of a library module. Please refer to the gen...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/integrity_constraints/ddl" : { "doc" : "<p>This module defines a set of functions to manage integrity constraints which are declared in the prolog of a module. For example, it provides functions to activate or deactivate integrity constraints. This module is part of Zorba's XQuery Data Definition Facility . All the integrity constraints mana...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/store/static/integrity_constraints/dml" : { "doc" : "<p>This module defines a function to check if an integrity constraint is satisfied. The integrity constraint needs to be declared in the prolog of a module. This module is part of Zorba's XQuery Data Definition Facility . All the integrity constraints managed by this module have to be pre-declared in t...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/string" : { "doc" : "<p>This module provides string related functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/system" : { "doc" : "<p>The system module allows developers to access system properties. Part of these system properties are environment variables, local variable to the process running Zorba, and properties defined by Zorba. To avoid conflicts between environment variables and properties defined by Zorba, all environment ...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/uri" : { "doc" : "<p>This module provides string related functions.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/util-jvm" : { "doc" : "<p>This module provides common functionality for modules that use java implementations. Modules using java implementations must import this module to specify the dependency. Note: Since this module has a Java library dependency a JVM is required to be installed on the system. For Windows: jvm.dll is re...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/xml" : { "doc" : "<p>This module provides functions for reading XML files from string inputs. It allows reading of well-formed XML documents as well as well-formed external parsed entities, described by XML 1.0 Well-Formed Parsed Entities . The functions can also perform Schema and DTD validation of the input documents....</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/xqdoc" : { "doc" : "<p>The goal of xqDoc is to provide a simple vendor neutral solution for documenting XQuery modules, as well as tools to generate a user friendly presentation of this documentation and cross referencing information. Therefore, xqDoc proposes a new commenting convention that extends the currently defined...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/xqdoc2xhtml/error" : { "doc" : "<p>This module defines all errors for the xqdoc2xhtml module.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/xqdoc2xhtml/" : { "doc" : "<p>Function library providing transformation functions from XQDoc to XHTML.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/modules/xsl-fo" : { "doc" : "<p>This module converts XSL-FO documents to various formats such as PDF, EPS, PCL, AFP, Text, PNG, Postscript, RTF, and TIFF. For instance, the following example converts a simple XSL-FO document to PDF: import module namespace fop = \"http://www.zorba-xquery.com/modules/xsl-fo\"; import module namespace...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.zorba-xquery.com/warnings" : { "doc" : "<p>This module contains one declaration of a variable for each error of the http://www.zorba-xquery.com/warnings namespace. The variables serves as documentation for the errors but can also be used in the code. For example, one useful scenario is to compare an error caught in the catch clause of a try-...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://expath.org/ns/error" : { "doc" : "<p>This module defines all errors for the http-client module.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://expath.org/ns/file" : { "doc" : "<p>This module implements the file API EXPath specification available at http://expath.org/spec/file</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://expath.org/ns/http-client" : { "doc" : "<p>This module provides an implementation of the EXPath Http Client . It provides functions for making HTTP requests and is a superset of the module specified by EXPath. Specifically, it implements the http:send-request() functions as specified by EXPath. Moreover, it adds an additional function http:r...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.jsoniq.org/errors" : { "doc" : "<p>This module contains one declaration of a variable for each error of the http://www.jsoniq.org/errors namespace. The variables serves as documentation for the errors but can also be used in the code. For example, one useful scenario is to compare an error caught in the catch clause of a try-catch ex...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.jsoniq.org/functions" : { "doc" : "<p>This module provides the functions defined by the JSONiq specification, sections 1.7 (Functions) and 1.10 (Update Primitives). JSONiq extends the XQuery specification to also deal with JSON data natively. See http://www.jsoniq.org/ for details. This module depends on having the JSONiq feature enable...</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.w3.org/2005/xpath-functions/math" : { "doc" : "<p>This module contains all the functions part of the W3C XPath and XQuery Functions and Operators 3.0 section \"4.7 Trigonometric and exponential functions\".</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.w3.org/2005/xpath-functions" : { "doc" : "<p>This module contains all the functions specified in the W3C XPath and XQuery Functions and Operators 3.0.</p>", "docUrl" : "http://www.28msec.com/modules/" }, "http://www.w3.org/2005/xqt-errors" : { "doc" : "<p>This module contains one declaration of a variable for each error of the http://www.w3.org/2005/xqt-errors namespace. The variables serves as documentation for the errors but can also be used in the code. For example, one useful scenario is to compare an error caught in the catch clause of a try-cat...</p>", "docUrl" : "http://www.28msec.com/modules/" } }